# FabricationPartDepthOutOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartDepthOutOption Property
ParameterTypeId Class See Also
---
"Main Secondary Depth Option"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartDepthOutOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartDepthOutOption As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartDepthOutOption {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace